// Создайте переменную num и присвойте ей значение 3.
// Выведите значение этой переменной на экран с помощью метода alert.

// Создайте переменные a = 10 и b = 2.
// Выведите на экран их сумму, разность, произведение и частное(результат деления).

// Создайте переменные c = 15 и d = 2.
// Просуммируйте их, а результат присвойте переменной result.Выведите на экран значение переменной result.

// Создайте переменные a = 10, b = 2 и c = 5.
// Выведите на экран их сумму.

// Создайте переменные a = 17 и b = 10.
// Отнимите от a переменную b и результат присвойте переменной c.
// Затем создайте переменную d, присвойте ей значение 7.
// Сложите переменные c и d, а результат запишите в переменную result.
// Выведите на экран значение переменной result.
// const a = 17;
// const b = 10;
// const c = a - b;
// const d = 7;
// const result = c + d;
// console.log(result);

// Создайте переменную str и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.

// Создайте переменные str1 = 'Привет, ' и str2 = 'Мир!'.
// С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

// Создайте переменную name и присвойте ей ваше имя.Выведите на экран фразу 'Привет, %Имя%!'.
// const name = 'Andrii';
// console.log(`Привет, ${name}!`);

// Создайте переменную age и присвойте ей ваш возраст.Выведите на экран 'Мне %Возраст% лет!'.
// const age = 32;
// console.log(`Мне ${age} лет!`);

// Спросите имя пользователя с помощью методы prompt.Выведите с помощью alert сообщение '%имя%'.
// const name = prompt('');
// alert(`Ваше имя ${name}`);
// Спросите у пользователя число.Выведите с помощью alert квадрат этого числа.
// Создайте переменную num и присвойте ей значение '12345'.Найдите произведение(умножение) цифр этого числа.
// const num = '12345';
// let sub = 1;
// for (const n of num) {
//   sub *= n;
// }
// console.log(sub);
// console.log(num[0] * num[1] * num[2] * num[3] * num[4]);

// Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.
// console.log(60 * 60);
// console.log(60 * 60 * 24);
// console.log(60 * 60 * 24 * 30);

// Создайте три переменные - час, минута, секунда.С их помощью выведите текущее время в формате 'час:минута:секунда'.
// const h = 13;
// const m = 45;
// const s = 55;
// alert(`${h}:${m}:${s}`);
// Создайте переменную, присвойте ей число.Возведите это число в квадрат.Выведите его на экран.

// Создайте массив arr = ['a', 'b', 'c'].Выведите его на экран с помощью функции alert.
// const arr = ['a', 'b', 'c'];
// console.log(arr);

// С помощью массива arr из предыдущего номера выведите на экран содержимое первого, второго и третьего элементов.
// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);

// Создайте массив arr = ['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.
// const arr = ['a', 'b', 'c', 'd'];
// console.log(`${arr[0]}+${arr[1]}, ${arr[2]}+${arr[3]}`);

// Создайте массив arr с элементами 2, 5, 3, 9.
// Умножьте первый элемент массива на второй, а третий элемент на четвертый.
// Результаты сложите, присвойте переменной result.
// Выведите на экран значение этой переменной.
// const arr = [2, 5, 3, 9];
// const result = arr[0] * arr[1] + arr[0] * arr[1];
// console.log(result);

// Создайте объект obj.Выведите на экран элемент с ключом 'c' двумя способами: через квадратные скобки и как свойство объекта:
// var obj = { a: 1, b: 2, c: 3 };
// const obj = { a: 1, b: 2, c: 3 };
// console.log(obj.c);
// console.log(obj['c']);

// Создайте массив заработных плат obj.Выведите на экран зарплату Пети и Коли.
// var obj = { Коля: '1000', Вася: '500', Петя: '200' };
// const obj = { Коля: '1000', Вася: '500', Петя: '200' };
// console.log(obj['Коля'], obj['Петя']);

// Создайте объект с днями недели.Ключами в нем должны служить номера дней от начала недели(понедельник - первый и т.д.).
// Выведите на экран текущий день недели.
// const obj = {
//   1: 'mon',
//   2: 'tue',
//   3: 'wed',
//   4: 'thu',
//   5: 'fri',
//   6: 'sat',
//   7: 'sun',
// };
// console.log(obj[4]);

// Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
// Выведите день недели, соответствующий значению переменной day.
// const day = 3;
// console.log(obj[day]);

// Дан массив[[1, 2, 3], [4, 5, 6], [7, 8, 9]].Выведите на экран цифру 4 из этого массива.
// const arr = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// console.log(arr[1][0]);

// Дан объект { js: ['jQuery', 'Angular'], php: 'hello', css: 'world' }.Выведите с его помощью слово 'jQuery'.
// const obj = { js: ['jQuery', 'Angular'], php: 'hello', css: 'world' };
// console.log(obj.js[0]);

// Создайте двухмерный массив.Первые два ключа - это 'ru' и 'en'.
// Пусть первый ключ содержит элемент, являющийся массивом названий дней недели по - русски,
// а второй - по - английски.Выведите с помощью этого массива понедельник по - русски
// и среду по английски(пусть понедельник - это нулевой день).
// const obj = {
//   ru: ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'],
//   en: ['пон', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'],
// };
// console.log(obj.ru[0]);
// console.log(obj.en[2]);

// Пусть теперь в переменной lang хранится язык(она принимает одно из значений или 'ru', или 'en' - либо то, либо то),
// а в переменной day - номер дня.Выведите словом день недели, соответствующий переменным lang и day.
// То есть: если, к примеру, lang = 'ru' и day = 3 - то выведем 'среда'.
// const lang = obj.ru;
// const day = 3;

// console.log(lang[day]);

// Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnA = a => console.log(a === 0);

// fnA(1);
// fnA(0);
// fnA(-3);

// Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnB = a => console.log(a > 0);

// fnB(1);
// fnB(0);
// fnB(-3);

// Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnC = a => console.log(a < 0);

// fnC(1);
// fnC(0);
// fnC(-3);
// Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnD = a => console.log(a >= 0);

// fnD(1);
// fnD(0);
// fnD(-3);

// Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnE = a => console.log(a <= 0);

// fnE(1);
// fnE(0);
// fnE(-3);
// Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 1, 0, -3.
// const fnF = a => console.log(a !== 0);

// fnF(1);
// fnF(0);
// fnF(-3);
// Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 'test', 'тест', 3.
// const fnG = a => console.log(a === 'test');

// fnG('test');
// fnG('тест');
// fnG(3);
// Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном '1', 1, 3.
// const fnH = a => {
//   if (a === '1') {
//     console.log('Верно');
//   } else {
//     console.log('Неверно');
//   }
// };
// fnH('1');
// fnH(1);
// fnH(3);

// Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при test, равном true, false.Напишите два варианта скрипта - с короткой записью и с длинной.
// const test = true;
// if (!test) {
//   console.log('верно');
// } else {
//   console.log('Неверно');
// }

// !test ? console.log('верно') : console.log('Неверно');

// Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при test, равном true, false.Напишите два варианта скрипта - с короткой записью и с длинной.
// !test ? console.log('Неверно') : console.log('верно');

// Если переменная a больше нуля и меньше 5 - ти, то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при a, равном 5, 0, -3, 2.
// const a = -3;
// if (a > 0 && a < 5) {
//   console.log('верно');
// } else {
//   console.log('Неверно');
// }

// Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
// Выведите новое значение переменной на экран.Проверьте работу скрипта при a, равном 5, 0, -3, 2.
// let a = 5;
// if (a === 0 || a === 2) {
//   a += 7;
//   console.log(a);
// } else {
//   a /= 10;
//   console.log(a);
// }
// Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных,
// иначе выведите их разность(результат вычитания).Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.
// let a = 3;
// let b = 5;
// if (a <= 1 && b >= 3) {
//   console.log(a + b);
// } else {
//   console.log(a - b);
// }
// Если переменная a больше 2 - х и меньше 11 - ти, или переменная b больше
// или равна 6 - ти и меньше 14 - ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// let a = 3;
// let b = 5;
// if ((a > 2 && a < 11) || (b >= 6 && b < 14)) {
//   console.log('Верно');
// } else {
//   console.log('Неверно');
// }

// Переменная num может принимать 4 значения: 1, 2, 3 или 4.
// Если она имеет значение '1', то в переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее.
// Решите задачу через switch-case.

// const num = 4;
// switch (num) {
//   case 1:
//     console.log('зима');
//     break;
//   case 2:
//     console.log('весна');
//     break;
//   case 3:
//     console.log('лето');
//     break;
//   case 4:
//     console.log('осень');
//     break;
//   default:
//     console.log('error');
// }
// console.log;

// В переменной day лежит какое - то число из интервала от 1 до 31.
// Определите в какую декаду месяца попадает это число(в первую, вторую или третью).
// const day = Math.round(Math.random() * (50 - 1) + 1);
// if (day >= 1 && day <= 10) {
//   console.log('first');
// } else if (day >= 11 && day <= 20) {
//   console.log('second');
// } else if (day >= 21 && day <= 31) {
//   console.log('third');
// } else {
//   console.log('error');
// }
// В переменной month лежит какое - то число из интервала от 1 до 12.
// Определите в какую пору года попадает этот месяц(зима, лето, весна, осень).
// const month = Math.round(Math.random() * (12 - 1) + 1);
// switch (month) {
//   case 1:
//   case 2:
//   case 12:
//     console.log('winter');
//     break;
//   case 3:
//   case 4:
//   case 5:
//     console.log('spring');
//     break;
//   case 6:
//   case 7:
//   case 8:
//     console.log('summer');
//     break;
//   case 9:
//   case 10:
//   case 11:
//     console.log('fall');
//     break;
//   default:
//     console.log('error');
// }
// console.log(month);

// Дана строка, состоящая из символов, например, 'abcde'.
// Проверьте, что первым символом этой строки является буква 'a'.Если это так - выведите 'да', в противном случае выведите 'нет'.

// Дана строка с цифрами, например, '12345'.
// Проверьте, что первым символом этой строки является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.

// Дана строка из 3 - х цифр.Найдите сумму этих цифр.
// То есть сложите как числа первый символ строки, второй и третий.

// Дана строка из 6 - ти цифр.Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
// Если это так - выведите 'да', в противном случае выведите 'нет'.
